Дипломная_работа/src/Catalogs/ВКМ_ПрофилиГруппДоступа/ВКМ_ПрофилиГруппДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВКМ_ПрофилиГруппДоступа</name>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Роли</name>
    <attributes>
      <name>ИмяРоли</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Дипломная_работа/src/CommonModules/ВКМ_УправлениеДоступом/Module.bsl
// Добавь эту процедуру в модуль ВКМ_УправлениеДоступом
Процедура ПринудительноСоздатьЗадание() Экспорт
	
	ИмяЗадания = "ВКМ_ОтправкаУведомленийТелеграмБоту";
	
	// Проверяем, есть ли такое задание в базе
	Отбор = Новый Структура("Метаданные", Метаданные.РегламентныеЗадания[ИмяЗадания]);
	НайденныеЗадания = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Отбор);
	
	Если НайденныеЗадания.Количество() = 0 Тогда
		// Создаем экземпляр задания
		НовоеЗадание = РегламентныеЗадания.СоздатьРегламентноеЗадание(Метаданные.РегламентныеЗадания[ИмяЗадания]);
		НовоеЗадание.Наименование = "Отправка уведомлений (создано программно)";
		НовоеЗадание.Использование = Истина;
		
		// Ставим расписание (300 сек)
		Расписание = Новый РасписаниеРегламентногоЗадания;
		Расписание.ПериодПовтораВТечениеДня = 300;
		НовоеЗадание.Расписание = Расписание;
		
		НовоеЗадание.Записать();
		Сообщить("--- РОБОТ: Регламентное задание успешно создано! ---");
	Иначе
		Сообщить("--- РОБОТ: Задание уже есть в списке ---");
	КонецЕсли;

КонецПроцедуры
                                     // Модуль отвечает за техническую реализацию обновления профилей в базе данных.
// Свойства модуля: Сервер, Вызов сервера.

Процедура ОбновитьПрофилиГруппДоступа() Экспорт
	
	// 1. Подготавливаем таблицу значений для сбора данных из переопределяемого модуля
	ОписаниеПрофилей = Новый ТаблицаЗначений;
	ОписаниеПрофилей.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	ОписаниеПрофилей.Колонки.Добавить("Наименование",  Новый ОписаниеТипов("Строка"));
	ОписаниеПрофилей.Колонки.Добавить("Роли",          Новый ОписаниеТипов("Массив"));
	
	// 2. Вызываем процедуру из ПЕРЕОПРЕДЕЛЯЕМОГО модуля для заполнения таблицы
	ВКМ_УправлениеДоступомПереопределяемый.ВКМ_ПриЗаполненииПрофилейГруппДоступа(ОписаниеПрофилей);
	
	// 3. Обходим полученные данные и обновляем справочник
	Для Каждого СтрокаОписание Из ОписаниеПрофилей Цикл
		
		// Ищем профиль по уникальному идентификатору
		ПрофильСсылка = Справочники.ВКМ_ПрофилиГруппДоступа.НайтиПоРеквизиту("Идентификатор", СтрокаОписание.Идентификатор);
		
		Если ПрофильСсылка.Пустая() Тогда
			ОбъектПрофиль = Справочники.ВКМ_ПрофилиГруппДоступа.СоздатьЭлемент();
			ОбъектПрофиль.Идентификатор = СтрокаОписание.Идентификатор;
		Иначе
			ОбъектПрофиль = ПрофильСсылка.ПолучитьОбъект();
		КонецЕсли;
		
		// Обновляем реквизиты
		ОбъектПрофиль.Наименование = СтрокаОписание.Наименование;
		
		// Очищаем и заново заполняем табличную часть "Роли"
		ОбъектПрофиль.Роли.Очистить();
		
		Для Каждого ИмяРоли Из СтрокаОписание.Роли Цикл
			НоваяСтрока = ОбъектПрофиль.Роли.Добавить();
			НоваяСтрока.ИмяРоли = ИмяРоли; // Убедись, что реквизит в ТЧ называется именно так
		КонецЦикла;
		
		// Записываем изменения в базу
		Попытка
			ОбъектПрофиль.Записать();
		Исключение
			ЗаписьЖурналаРегистрации("Обновление профилей", УровеньЖурналаРегистрации.Ошибка, , , 
				"Не удалось записать профиль: " + СтрокаОписание.Наименование + ". Ошибка: " + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры
